name: "gpt2_onnx"
backend: "onnxruntime"
max_batch_size: 0        # 0 = disabled, GPT-2 handles batching internally

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1, -1 ]     # [batch, sequence_length] — dynamic
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ -1, -1 ]
  },
  {
    name: "position_ids"
    data_type: TYPE_INT64
    dims: [ -1, -1 ]
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [ -1, -1, 50257 ]   # [batch, sequence, vocab_size]
  }
]

instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]